ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC9_I2CC_1.0.xml
        </group>
    <group id="UC9_I2CC_DMA_TRIG0" name="UC9_I2CC_DMA_TRIG0" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UC9_I2CC_DMA_TRIG0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC9_I2CC_DMA_TRIG0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC9_I2CC_DMA_TRIG0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC9_I2CC_DMA_TRIG0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        </group>
    <register id="UC9_I2CC_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="UC9_I2CC_CTR" width="32" offset="0x1100" description="Control Register">
        <bitfield id="FRM_START" description="Start Transfer" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="In standard mode, this encoding means the Controller is unable to transmit or receive data."/>
            <bitenum id="ENABLE" value="0x1" description="The Controller is able to transmit or receive data. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="START" description="Generate START" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The controller does not generate the START condition."/>
            <bitenum id="ENABLE" value="0x1" description="The controller generates the START or repeated START condition. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="STOP" description="Generate STOP" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The controller does not generate the STOP condition."/>
            <bitenum id="ENABLE" value="0x1" description="The controller generates the STOP condition. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="ACK" description="Data Acknowledge Enable.
Software needs to configure this bit to send the ACK or NACK.
See field decoding in Table: MCTR Field decoding." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The last received data byte of a transaction is not acknowledged automatically ."/>
            <bitenum id="ENABLE" value="0x1" description="The last received data byte of a transaction is acknowledged automatically ."/>
        </bitfield>
        <bitfield id="ACKOEN" description="ACK overrride Enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When 1 and the Controller is receiving data and the number of bytes indicated in MBLEN have been received, the state machine will generate an rxdone interrupt and wait at the start of the ACK for FW to indicate if an ACK or NACK should be sent. The ACK or NACK is selected by writing the MCTR register and setting ACK accordingly. The other fields in this register can also be written at this time to continue on with the transaction. If a NACK is sent the state machine will automatically send a Stop."/>
        </bitfield>
        <bitfield id="RD_ON_TXEMPTY" description="Read on TX Empty" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When 1 the Controller will transmit all bytes from the TX FIFO before continuing with the programmed Burst Run Read. If the DIR is not set to Read in the MSA then this bit is ignored. The Start must be set in the MCTR for proper I2C protocol. The Controller will first send the Start Condition, I2C Address with R/W bit set to write, before sending the bytes in the TX FIFO. When the TX FIFO is empty, the I2C transaction will continue as programmed in MTCR and MSA without sending a Stop Condition.
This is intended to be used to perform simple I2C command based reads transition that will complete after initiating them without having to get an interrupt to turn the bus around."/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>
